{% extends 'fr/_fr.html' %}
{% set title = 'Utilisation avancée des objets graphiques' %}

{% block content %}
<h1 align="center">Utilisation avancée des objets graphiques
</h1>
<h3 align="center" style ="font-size: 0.6em">auteur : Philippe Saadé (2008), psaade@gmail.com
</h3>
<br><br>


<div class="bodypadding">Avec {{ sage }}, la plupart des commandes graphiques produisent d'abord un objet de type <span class="code">Graphics</span> qui est ensuite rendu par la commande <span class="code">show()</span>, et ce même si l'utilisateur ne la sollicite pas directement.<br>
<br>
Nous allons expliquer ici comment l'on peut modifier un objet graphique et également comment on peut associer plusieurs objets graphiques.
</div><br>

Plan :
<ul style="padding-left: 2em;">

<li>
<a href="#ah1">Modification d'un objet graphique</a>
<ul>
<li><a href="#a1">Création de l'objet graphique</a>
</li>
<li><a href="#a2">Modification du rapport d'échelle entre abscisse et ordonnée</a>
</li>
<li><a href="#a3">Modification de la plage des x et y</a>
</li>
<li><a href="#a4">Changer l'épaisseur des axes</a>
</li>
<li><a href="#a5">Suppression des axes</a>
</li>
<li><a href="#a6">Réglages de couleurs pour les axes</a>
</li>
<li><a href="#a7">Fixer des labels pour les axes et ajuster leur couleur</a>
</li>
<li><a href="#a8">Modifier la taille de police pour les labels d'axes et les graduations</a>
</li>
<li><a href="#a9">Sauvegarder un graphique dans un fichier informatique</a>
</li>

</ul>
</li>

<li>
<a href="#ah2">Utiliser plusieurs objets graphiques</a>
<ul>
<li><a href="#b1">Superposer deux graphiques</a>
</li>
<li><a href="#b2">Superposer plusieurs graphiques</a>
</li>
<li><a href="#b3">Agencer des objets graphiques pour n'en former qu'un</a>
</li>
<li><a href="#c1">Placer du texte sur un graphique</a>
</li>
<li><a href="#c2">Placer du texte au format LaTeX dans une feuille interactive</a>
</li>
<li><a href="#c3">Placer du code LaTeX dans une cellule</a>
</li>


</ul>
</li>

</ul>


<br><br>

<a name="ah1"></a>
<h1>Modification d'un objet graphique
</h1>


<a name="a1"></a>
<h3>Création de l'objet graphique
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>var('x')</strong>
 sage: <strong>f(x) = sin(10*x)/(1+x^2)</strong>
 sage: <strong>p = plot(f, (-3,3), plot_points=400)</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Il est très facile de produire un objet graphique. La simple évaluation de cet objet entraine son rendu par la commande <span class="code">show()</span>

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_0.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a2"></a>
<h3>Modification du rapport d'échelle entre abscisse et ordonnée
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=300)</strong>
 sage: <strong>p.set_aspect_ratio(1)</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     La méthode <span class="code">set_aspect_ratio()</span> permet de fixer le rapport de l'échelle des abscisses sur l'échelle des ordonnées.<br/>
On obtient une représentation orthonormée en fixant ce rapport à 1.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_1.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a3"></a>
<h3>Modification de la plage des x et y
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=400)</strong>
 sage: <strong>p.axes_range(-4,4,-2,2)  # ou p.xmin(-4)
   ; p.xmax(4); p.ymin(-2); p.ymax(2)</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Le moyen le plus direct est d'utiliser la commande <span class="code">axes_range()</span> à laquelle on fournit les valeurs xmin, xmax, ymin, ymax. Un accès individuel à chacune de ces valeurs est également possible avec <span class="code">xmin()</span>, etc.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_7.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a4"></a>
<h3>Changer l'épaisseur des axes
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=400)</strong>
 sage: <strong>p.axes_width(2)</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     La valeur (en point typographique) est fixée par la méthode <span class="code">axes_width()</span>.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_8.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a5"></a>
<h3>Suppression des axes
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=300)</strong>
 sage: <strong>p.set_aspect_ratio(1)</strong>
 sage: <strong>p.axes(False)</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Si l'on ne souhaite pas afficher les axes, on utilise la modificateur <span class="code">axes()</span> avec la valeur <span class="code">False</span>. L'opération inverse est possible avec la valeur <span class="code">True</span>.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_2.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a6"></a>
<h3>Réglages de couleurs pour les axes
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=400)</strong>
 sage: <strong>p.axes_color((1,0.5,0.2))</strong>
 sage: <strong>p.tick_label_color('green')</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Il est possible d'influer sur la couleur des axes eux-mêmes avec la méthode <span class="code">axes_color</span> et sur la couleur des chiffres de graduation avec la méthode <span class="code">tick_label_color()</span>.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_3.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a7"></a>
<h3>Fixer des labels pour les axes et ajuster leur couleur
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=400)</strong>
 sage: <strong>p.axes_labels(['ici x','ici y'])</strong>
 sage: <strong>p.axes_label_color(hue(0.8))</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Cela se fait très simplement avec les méthodes <span class="code">axes_label()</span> et <span class="code">axes_label_color()</span>.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_4.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a8"></a>
<h3>Modifier la taille de police pour les labels d'axes et les graduations
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=400)</strong>
 sage: <strong>p.axes_labels(['ici x','ici y'])</strong>
 sage: <strong>p.axes_label_color(hue(0.8))</strong>
 sage: <strong>p.fontsize(15)</strong>
 sage: <strong>p</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     C'est la méthode <span class="code">fontsize()</span> qui permet de le faire. Le chiffre fourni a pour unité le point typographique et fixe la taille de la police pour les labels <em>et</em> les chiffres de graduation.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_9.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="a9"></a>
<h3>Sauvegarder un graphique dans un fichier informatique
</h3>


<table class="top">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>p = plot(f, (-3,3), plot_points=400)</strong>
 sage: <strong>p.save('/tmp/fichier.png')  # ou .ps, .e
   ps, .svg</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     On fournit à la méthode <span class="code">save()</span> une chaîne de caractère correspondant à un chemin valide sur le disque dur de l'ordinateur (système de fichier) en précisant le format souhaité grâce à l'extension. Quatre choix sont possibles : .png, .ps, .eps, .svg.

    </td>
   </tr>


</tbody>
</table>


<table class="top">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong></strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     
    </td>
   </tr>


</tbody>
</table>


<a name="ah2"></a>
<h1>Utiliser plusieurs objets graphiques
</h1>


<a name="b1"></a>
<h3>Superposer deux graphiques
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>x = var('x')</strong>
 sage: <strong>g1 = plot(cos(20*x)*exp(-2*x), 0, 1, rgb
   color='red')</strong>
 sage: <strong>g2 = plot(2*exp(-30*x) - exp(-3*x), 0, 1
   )</strong>
 sage: <strong>g1+g2</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     {{ sage }} offre un moyen très simple de fusionner deux graphiques l'un sur l'autre pour obtenir un graphique unique : l'addition !

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_22.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>



<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>var('x')</strong>
 sage: <strong>p1 = plot( cos(x), (-pi,pi), rgbcolor='r
   ed')</strong>
 sage: <strong>p2 = plot( sin(x), (-pi,pi), linestyle='
   --')</strong>
 sage: <strong>p1+p2</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Et cela marche même si les types de traits sont différents

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_25.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="b2"></a>
<h3>Superposer plusieurs graphiques
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>var('x')</strong>
 sage: <strong>G = sum([plot(sin(n*x), (x,-2*pi, 2*pi),
    hue=n).plot() for n in [0,0.1,..1]])</strong>
 sage: <strong>G</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     C'est avec la même simplicité que l'on peut superposer plusieurs tracés de courbes sur un même graphique.<br>
C'est d'ailleurs une règle qui est valable pour tous les objets graphiques.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_24.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="b3"></a>
<h3>Agencer des objets graphiques pour n'en former qu'un
</h3>



<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>x = var('x')</strong>
 sage: <strong>g1 = plot(cos(20*x)*exp(-2*x), 0, 1)</strong>
 sage: <strong>g2 = plot(2*exp(-30*x) - exp(-3*x), 0, 1
   )</strong>
 sage: <strong>show(graphics_array([g1, g2], 2, 1), xmi
   n=0)</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     {{ sage }} permet de positionner des objets graphiques existant en ligne et/ou en colonne pour former un graphique unique structuré en tableau. On utilise pour cela la commande <span class="code">graphics_array()</span> en plaçant tous les graphiques dans une liste, puis en indiquant le format du tableau souhaité (nombre de lignes puis nombre de colonnes).

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_19.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="c1"></a>
<h3>Placer du texte sur un graphique
</h3>


<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>f = lambda x: (x-3)*(x-5)*(x-7)+40</strong>
 sage: <strong>P = line([(2,0),(2,f(2))], rgbcolor=(0,0
   ,0))</strong>
 sage: <strong>P += line([(8,0),(8,f(8))], rgbcolor=(0,
   0,0))</strong>
 sage: <strong>P += polygon([(2,0),(2,f(2))] + [(x, f(x
   )) for x in [2,2.1,..,8]] + [(8,0),(2,0)
   ],  rgbcolor='#ffecc9')</strong>
 sage: <strong>P += text("$\\int_{a}^b f(x) dx$", (5, 2
   0), fontsize=18, rgbcolor=(0,0,0))</strong>
 sage: <strong>P += plot(f, 1, 8.5, thickness=3, rgbcol
   or='#a66c1f')</strong>
 sage: <strong>P</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Ceci peut se faire à l'aide de la commande <span class="code">text()</span> qui prend en entrée une chaîne de caractères, contenant éventuellement des formules mathématiques simples. Les compositions LaTeX complexes ne seront malheureusement pas acceptées par cette commande.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_20.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="c2"></a>
<h3>Placer du texte au format LaTeX dans une feuille interactive
</h3>


<table class="top">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>jsmath(r'\left(\begin{array}{ll}1&2\\3&4
   \end{array}\right)')</strong>
</pre>
     <pre class="code-ans">   
   <html><div class="math">\left(\begin{arr
   ay}{ll}1&2\\3&4\end{array}\right)</div><
   /html>

</pre>
    </td>
    <td class="rightpadding">
     Ceci ne s'applique pas au rendu des objets de type Graphics et ne fonctionne que dans les cellules interactives (utilisant donc l'annotation @interact).<br>
La commande <span class="code">jsmath()</span> produit une image prise en charge par le navigateur web et qui s'affiche à la suite de la commande. Comme il ne s'agit pas d'un objet de type Graphics, on ne peut pas l'additionner à un graphe de courbe par exemple. Mais la commande <span class="code">jsmath()</span> peut traiter beaucoup plus de code LaTeX que la commande <span class="code">text()</span<br>.
<br>
Il faut noter la présence du 'r' précédant la chaîne de caractère. Ce modificateur empêche Python de considérer le caractère \ comme un caractère d'échappement, laissant le code LaTeX intact.

    </td>
   </tr>


</tbody>
</table>



<table class="top">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>jsmath('\\left(\\begin{array}{ll}1&2\\\\
   3&4\\end{array}\\right)')</strong>
</pre>
     <pre class="code-ans">   
   <html><div class="math">\left(\begin{arr
   ay}{ll}1&2\\3&4\end{array}\right)</div><
   /html>

</pre>
    </td>
    <td class="rightpadding">
     Sans la présence du 'r' précédant la chaîne de caractère, il faut doubler tous les \.

    </td>
   </tr>


</tbody>
</table>



<table class="top">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>var('u')</strong>
 sage: <strong>f(u) = sin(u)</strong>
 sage: <strong>DLf = taylor(f, u, 0, 5)</strong>
 sage: <strong>jsmath(r'%s'%latex(DLf))</strong>
</pre>
     <pre class="code-ans">   
   <html><div class="math">u \{\mapsto}\ u - \frac{ {u}^{3} }{6} + \frac{ {u}^{5} }{120}</div></html>

</pre>
    </td>
    <td class="rightpadding">
     L'intérêt essentiel de la commande <span class="code">jsmath()</span> est de permettre l'affichage du résultat d'un calcul effectué par {{ sage }} avec une mise en forme LaTeX. C'est d'autant plus intéressant que dans une cellule interactive, le résultat n'est pas connu à l'avance !

    </td>
   </tr>


</tbody>
</table>



<table class="top" style="width: 100%">
  <colgroup>
   <col width="50%">
   <col width="50%">
  </colgroup>
  <tbody>
   <tr>
    <td class="leftpadding">
     <pre class="code">
 sage: <strong>text('$%s$'%latex(DLf),(0.5,0.5),fontsiz
   e=18)</strong>
</pre>
     <pre class="code-ans">
</pre>
    </td>
    <td class="rightpadding">
     Ici, la commande <span class="code">text()</span> ne produit pas le bon résultat.

    </td>
   </tr>
<tr>
<td class="bodypadding" colspan="2">
 <div class="txt center">
  <img src="./pix2/img_34.png" alt="" height="370" width="600">
</div>

</td>
</tr>
</tbody>
</table>


<a name="c3"></a>
<h3>Placer du code LaTeX dans une cellule</h3>

<div>Il est possible de remplir une cellule de code LaTeX. Il suffit de commencer par %latex.
</div>

\{\{\{id=32|
%latex
The equation $y^2 = x^3 + x$ defines an elliptic curve.
We have $2006 = \sage{factor(2006)}$.
///
\}\}\}

\{\{\{id=35|

///
\}\}\}
 <div style="height: auto; min-height: 50px;"> </div>
<div id="footer" class="center">
<table><tbody><tr>
<td><a id="footer-webmaster" href="mailto:harald.schilly@gmail.com"></a></td><td>·</td>
<td><a id="footer-cc" title="Content is Creative Commons 3.0 licensed" href="http://creativecommons.org/licenses/by/3.0/" target="_blank"></a></td><td>·</td>
<td><a id="footer-donate" title="Donate to the UW {{ sage }} Foundation Fund" href="https://secure.gifts.washington.edu/as_mathematics/gift.asp?page=make&amp;Code=MATSAG" target="_blank"></a></td><td>·</td>
<td><a id="footer-rss" title="RSS News Feed" href="http://groups.google.com/group/sage-announce/feed/atom_v1_0_msgs.xml"></a></td>
</tr></tbody></table>
</div>
{% endblock %}
