{% extends 'base.html' %}
{% set title = "Tour - Benchmarks" %}

{% block header %}
<style type="text/css">
.red {font-weight: bold; color: red; font-size: large;}
.green {font-weight: bold; color: green; font-size: large;}
pre { padding-top: 15px; }
</style>
{% endblock %}

{% block content %}
 <h1>Tour - Benchmarks</h1>

<div class="bodypadding txt">Here are some comparisons of {{ sage }} with other systems. Each pair of comparison was made on the same system and it was carfully avoided to hit swap memory to avoid accidental slowdows. Unless otherwise noted, all timings are in seconds.
<br/>
Links: <a href="http://wiki.sagemath.org/sagebeatsmagma">List of Computations where {{ sage }} is Noticeably Faster than Magma...</a></div>

 <table class="top" style="width:100%">
  <colgroup>
   <col width="50%" />
   <col width="50%" />
  </colgroup>
 
  <tbody>

<tr><th colspan="2"> <h3>Multiply Integers $$({12345}^{678900} - 1) * ({67890}^{123456} - 1)$$</h3> </th> </tr>
<tr> <td class="leftpadding"> {{ sage }} 4.1.1
<pre class="code txt">
sage: a1 = 12345^678900 - 1
sage: a2 = 67890^123456 - 1
sage: len(str(a1))
2777714
sage: len(str(a2))
596516
sage: %timeit a1*a2
10 loops, best of 3: <span class="green">278 ms</span> per loop
</pre> </td>

<td class="rightpadding"> Mathematica 7
<pre class="code txt">
In[2]:= a1 = 12345^678900 - 1;
In[3]:= a2 = 67890^123456 - 1;
In[4]:= Timing[a1*a2][[1]]
Out[4]= <span class="red">0.368023</span>
</pre> </td>
<tr><td colspan="2" class="leftpadding">
Note: "ms" is Milliseconds ($$10^{-3}$$).<br/>{{ sage }} is 32% faster.<br/>
System: Intel 32bit, Linux</td></tr>


 <tr> <th colspan="2"> <h3>factorial 10000000!</h3> </th> </tr>

   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.1
     <pre class="code txt">
sage: time a = factorial(10000000) 
CPU times: user <span class="green">13.79 s</span>,...
</pre>
    </td>

    <td class="rightpadding">
Mathematica 7
<pre class="code txt">
In[12]:= Timing[10000000!][[1]] 
Out[12]= <span class="red">19.2908</span> 
</pre>
</td>
<tr><td colspan="2" class="leftpadding">{{ sage }} is 40% faster.<br/>System: Mac OSX</td></tr>
   </tr>

 <tr> <th colspan="2"> <h3>Integer Factorization of $$2^{512} - 1$$</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.1
     <pre class="code txt">
sage: time a = factor(2^512 - 1) 
CPU times: user <span class="green">92.29 s</span>,...
</pre>
    </td>

    <td class="rightpadding">
Mathematica 7
     <pre class="code txt">
In[10]:= Timing[FactorInteger[2^512 - 1]][[1]]
Out[10]= <span class="red">346.494</span> 
</pre>
</td>
   </tr>
<tr><td colspan="2" class="leftpadding">System: Intel 32bit, Linux<br/>
{{ sage }} is nearly 4 times faster.</td></tr>

<tr> <th colspan="2"> <h3>Bernoulli Number $$3 * 10^5$$</h3> </th> </tr>
   <tr>
    <td class="leftpadding"> {{ sage }} 4.1.1
<pre class="code txt">
sage: %time _ = bernoulli(3*10^5)
CPU times: user <span class="green">141.04 s</span>,...
</pre>
<a href="http://arxiv.org/abs/0807.1347">David Harvey, A multimodular algorithm for computing Bernoulli numbers, 2008</a>
</td>

<td class="rightpadding"> Mathematica 7
<pre class="code txt">
In[1]:= Timing[BernoulliB[3*10^5]][[1]]
Out[1]= <span class="red">214.842</span>
</pre>
<a href="http://blog.wolfram.com/2008/04/29/today-we-broke-the-bernoulli-record-from-the-analytical-engine-to-mathematica/">Wolfram Blog about Bernoulli Numbers</a>
</td>
   </tr>
<tr><td colspan="2" class="leftpadding">System: Intel 32bit, Linux<br/>
{{ sage }} is 52% faster.</td></tr>



 <tr> <th colspan="2"> <h3>5 Million Digits of $$\pi$$</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.1 (pure and using mpmath)
     <pre class="code txt">
sage: time a = N(pi, digits=5000000) 
CPU times: user <span class="red">28.90 s</span>,...
Wall time: 28.96 s

However, mpmath is (barely) faster than Mathematica: 
sage: from sage.libs.mpmath.all import pi as p 
sage: time a = p(dps=5000000) 
CPU times: user <span class="green">12.56 s</span>,...
Wall time: 12.70 s 
</pre>
    </td>

    <td class="rightpadding">
Mathematica 7
     <pre class="code txt">
In[1]:= Timing[N[Pi, 5000000]][[1]] 
Out[1]= <span class="red">13.21</span>
</pre>
</td>
   </tr>
 <tr> <th colspan="2"> <h3>Pseudoprimality Test $$2^{19937} - 1$$</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.1
     <pre class="code txt">
sage: time a = is_pseudoprime(2^19937 - 1) 
CPU times: user <span class="green">16.61 s</span>,...
</pre>
    </td>

    <td class="rightpadding">
Mathematica 7
     <pre class="code txt">
In[11]:= Timing[PrimeQ[2^19937 - 1]][1]
Out[11]= {<span class="red">28.2604</span>, True}[1]
</pre>
</td>
   </tr>
 <tr> <th colspan="2"> <h3>Expanding a Symbolic Expression</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.1
     <pre class="code txt">
sage: R.&lt;a1,a2,a3,a4,a5,a6,a7&gt; = QQ[] 
sage: time f = (a1+a2+a3+a4+a5+a6+a7)^25
CPU times: user <span class="green">8.56 s</span>,...
Wall time: 8.97 s

sage: var('a1 a2 a3 a4 a5 a6 a7')
(a1, a2, a3, a4, a5, a6, a7)
sage: time f = expand((a1+a2+a3+a4+a5+a6+a7)^25)
CPU times: user <span class="red">19.94 s</span>,...
Wall time: 20.59 s
</pre>
    </td>

    <td class="rightpadding">
Mathematica 7
     <pre class="code txt">
In[15]:= Timing[Expand[(a1+a2+a3+a4+a5+a6+a7)^25]][[1]]
Out[15]= <span class="green">15.981</span>
</pre>
</td>
   </tr>
<tr><td colspan="2" class="leftpadding">System: Intel 32bit, Linux</td></tr>

 <tr><th colspan="2"><h3>Expanding a Polynomial over $$GF(13)$$</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.1
     <pre class="code txt">
sage: R.&lt;x,y,z&gt; = PolynomialRing(GF(13)) 
sage: time _ = expand((x+y+z+1)**100) 
CPU times: user <span class="green">0.07 s</span>,...
</pre>
    </td>

    <td class="rightpadding">
Mathematica 7
     <pre class="code txt">
In[1]:= Timing[Expand[(x+y+z+1)^100, Modulus -&gt; 13]][[1]] 
Out[1]= <span class="red">4.20826</span>
</pre>
</td>
   </tr>
<tr><td colspan="2" class="leftpadding">
{{ sage }} is 60 times faster.<br/>
System: Intel 32bit, Linux</td></tr>

 <tr> <th colspan="2"> <h3>Multiply and Add Random Boolean Matrices in $$GF(2)$$</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.1
     <pre class="code txt">
sage: m1 = random_matrix(GF(2), 1000, 1000) 
sage: m2 = random_matrix(GF(2), 1000, 1000) 
sage: %timeit m1*m2
100 loops, best of 3: <span class="green">9.76 ms</span> per loop
sage: %timeit m1+m2
1000 loops, best of 3: <span class="green">344 µs</span> per loop
</pre>
<br/>
<a href="http://m4ri.sagemath.org/performance.html">M4RI Performance Comparisons</a>
<br/>
<a href="http://wiki.sagemath.org/days7/sprints/linalg">More about Matrix Multiplications ({{ sage }} Days 7/LinAlg)</a>
</td>

    <td class="rightpadding">
Mathematica 7     
<pre class="code txt">
In[15]:= m1 := RandomInteger[{0,1},{1000, 1000}] 
In[16]:= m2 := RandomInteger[{0,1},{1000, 1000}] 
In[17]:= Timing[Mod[m1.m2, 2]][[1]] 
Out[17]= <span class="red">30.7219</span>
In[18]:= Timing[Mod[m1+m2, 2]][[1]] 
Out[18]= <span class="red">0.060003</span> 
</pre>
<br/>
Magma<br/>
<a href="http://wiki.sagemath.org/sagebeatsmagma">{{ sage }} vs. Magma for this particular type of problem.</a>
</td>
   </tr>
<tr><td colspan="2" class="leftpadding">
Note: "ms" is Milliseconds ($$10^{-3} s$$); "µs" is Microseconds ($$10^{-6} s$$)<br/>
System: Intel 32bit, Linux<br/>
{{ sage }} is about 3000 times faster.</td></tr>

 <tr> <th colspan="2"> <h3>Matrix Multiplication in {{ sage }} vs. MATLAB and Mathematica</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.1.2
     <pre class="code txt">
age:  a = random_matrix(RDF,2000) 
sage: timeit('a*a') 
5 loops, best of 3: <span class="green">3.28 s</span> per loop 
</pre>
    </td>

    <td class="rightpadding">
MATLAB 2009a
     <pre class="code txt">
a = rand(2000);
tic; a*a; toc
Elapsed time is 5.686150 seconds.
tic; a*a; toc
Elapsed time is <span class="red">5.688004</span> seconds.
</pre>
<br/>Mathematica 7.0
<pre class="code txt">
b = Table[
 RandomReal[
  UniformDistribution[{0, 1}]], 
    {2000}, {2000}];

Timing[b . b][[1]]
<span class="red">5.95637</span>
</pre>
</td>
   </tr>
<tr><td colspan="2" class="leftpadding">System: Intel 32bit, Linux</td></tr>

 <tr> <th colspan="2"> <h3>Full SVD of a 1000x1000 Random Matrix</h3> </th> </tr>
   <tr>
    <td class="leftpadding">
{{ sage }} 4.3.2
     <pre class="code txt">
sage: m = random_matrix(RDF, 1000)
sage: %time U,s,Vh = m.SVD()
CPU times: user <span class="green">2.38 s</span>, sys: 0.08 s, total: 2.77 s
</pre>
Using <a href="http://www.netlib.org/lapack/double/dgesdd.f">dgesdd.f</a>.
    </td>

    <td class="rightpadding">
MATLAB R2009a
     <pre class="code txt">
s = 1000;
m = randn(s,s);
tic; [u,s,v] = svd(m); toc
Elapsed time is <span class="red">9.666150</span> seconds
</pre>
Using <a href="http://www.netlib.org/lapack/double/dgesvd.f">dgesvd.f</a>.
</td>
   </tr>
<tr><td colspan="2" class="leftpadding">System: Intel 32bit, Linux</td></tr>

<!--
 <tr> <th colspan="2"> <h3></h3> </th> </tr>
   <tr>
    <td class="leftpadding">
     <pre class="code txt">
</pre>
    </td>

    <td class="rightpadding">
     <pre class="code txt">
</pre>
</td>
   </tr>
-->

  </tbody>
 </table>

 <div class="txt"></div>

 <div class="narrow center txt">
  <a href="./tour-quickstart.html">Tour Quickstart</a>  &middot;  <a href="./tour-graphics.html">Tour
  Graphics</a>
 </div>
{% endblock %}
